backend/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 10 

scenarios:
  - name: "Restaurant Menu"
    flow:
      - get:
          url: "/restaurant/menu"
          headers: 
            userId: "66f490ba5260ca6de87bbb18"

  - name: "Restaurants by Food Type"
    variables:
      foodType:
        - pizza
        - burger
        - coffee
    flow:
      - get:
          url: "/customer/restaurants/by-food-type/{{ foodType }}"